export const encounterMap: { [key: string]: { [key: string]: Array<string> } } = {
    "발탄": {
        "발탄 1관문": ["검은 산의 포식자", "파괴자 루카스", "통솔자 루가루"],
        "발탄 2관문": ["마수군단장 발탄", "찢겨진 마수의 군주"]
    },
    "비아키스": {
        "비아키스 1관문": ["인큐버스 모르페", "악몽의 모르페"],
        "비아키스 2관문": ["욕망의 탐식자 비아키스"],
        "비아키스 3관문": ["욕망군단장 비아키스"]
    },
    "쿠크세이튼": {
        "쿠크세이튼 1관문": ["세이튼"],
        "쿠크세이튼 2관문": ["쿠크"],
        "쿠크세이튼 3관문": ["쿠크세이튼", "앵콜을 외친 쿠크세이튼"]
    },
    "아브렐슈드": {
        "아브렐슈드 1관문": ["게헤나 헬카서스"],
        "아브렐슈드 2관문": ["프로켈", "프로켈의 사념체", "아슈타로테"],
        "아브렐슈드 3관문": ["태초의 악몽"],
        "아브렐슈드 4관문": ["몽환군단장 아브렐슈드"],
        "아브렐슈드 5관문": [
            "악몽의 지배자 아브렐슈드",
            "심상 태초의 악몽",
            "아공간 태초의 악몽"
        ],
        "아브렐슈드 6관문": ["몽환군단장 아브렐슈드"]
    },
    "카양겔": {
        "카양겔 1관문": ["티엔"],
        "카양겔 2관문": ["프리우나"],
        "카양겔 3관문": ["라우리엘"]
    },
    "일리아칸": {
        "일리아칸 1관문": ["비통의 지배자 마우르그", "진화된 마우르그"],
        "일리아칸 2관문": ["쇠락의 군주 일리아칸"],
        "일리아칸 3관문": ["질병군단장 일리아칸", "일리아칸, 카르테론의 군주"]
    },
    "상아탑": {
        "상아탑 1관문": ["피어나는 혼돈, 칼테이야"],
        "상아탑 2관문": ["웅크린 교만, 라카이서스"],
        "상아탑 3관문": ["대지를 짓밟는 파이어혼"],
        "상아탑 4관문": [
            "길을 여는 자, 라자람",
            "종속된 베르투스",
            "종속된 칼벤투스",
            "종속된 레기오로스",
            "종속의 낙인"
        ]
    },
    "카멘": {
        "카멘 1관문": ["칠흑의 숭배자, 킬리네사"],
        "카멘 2관문": ["어둠의 기사, 발리나크", "금기를 삼킨 자, 발리나크", "종언을 고하는 자, 발리나크"],
        "카멘 3관문": ["빛을 꺼트리는 자, 카멘", "어둠의 대검"],
        "카멘 4관문": ["어둠군단장 카멘", "내부 카멘", "별을 제패한 자, 카멘"]
    },
    "에키드나": {
        "에키드나 1관문": ["붉은 재앙, 다르키엘", "아그리스"],
        "에키드나 2관문": [
            "에키드나",
            "욕망의 주인, 에키드나",
            "만개한 욕망, 에키드나",
            "뒤엉킨 맹독, 알키오네",
            "삼키는 수렁, 아그리스"
        ]
    },
    "베히모스": {
        "베히모스 1관문": ["폭풍의 지휘관, 베히모스"],
        "베히모스 2관문": ["잔혹한 폭풍의 처단자, 베히모스"]
    }
};

export const difficultyMap: Array<string> = ["노말", "하드", "헬", "도전", "시련", "익스트림", "더 퍼스트"];
